# coding:utf-8

print("=========================================Python打开文件========================================================")
# 1.Python打开文件
file = open("test_01.txt", "r")
print(file)
print("=========================================Python File对象的属性==================================================")
# 2.Python File对象的属性
print("判断文件是否已关闭:", file.closed)
print("被打开文件的访问模式:", file.mode)
print("文件的名称:", file.name)

print("=========================================Python关闭文件=================================================")
# 3.Python关闭文件
file.close()
print("判断文件是否已关闭:", file.closed)

print("=========================================Python读文件================================================")
# 3.Python读文件
# with语句可以自动帮我们调用close()方法，而第二种方式需要我们手动调用 file.close() 来关闭文件
# 读取文件的第一种方式
print("=========================================读取文件的第一种方式================================================")
with open("test_02.txt") as file2:
    data = file2.read()
    print(data)
print("判断文件是否已关闭:", file2.closed)
print("=========================================读取文件的第二种方式===============================================")
# 读取文件的第二种方式
file2 = open("test_02.txt", "r")
print(file2.read())
print("判断文件是否已关闭:", file2.closed)
# readlines()：读取整个文件的所有行，保存在一个列表(list)变量中，每行作为一个元素，但读取大文件会比较占内存。
print("=========================================读取文件:readlines()===============================================")
f = open("test_02.txt", "r")
try:
    for lines in f.readlines():
        print(lines, end='')
finally:
    f.close()
print("\n=========================================Python写文件================================================")
# 4.Python写文件
file3 = open("test_03.txt", "a")
file3.write("\n天津")
seq = ["\n太原", "\n大同"]
file3.writelines(seq)

